Ran Plan for dir: `live/newsletter-server` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/atlantis-data/repos/meysam81/infra/41/default/live/newsletter-server": exit status 1: running "terragrunt plan -input=false $(printf '%s' $COMMENT_ARGS | sed 's/,/ /g' | tr -d '\\\\') -no-color -out $PLANFILE" in "/atlantis-data/repos/meysam81/infra/41/default/live/newsletter-server": 
19:27:04.417 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Initializing the backend...
19:27:04.422 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Initializing the backend...
19:27:05.642 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: 
19:27:05.642 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
19:27:05.642 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: use this backend unless the backend configuration changes.
19:27:05.643 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: 
19:27:05.643 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
19:27:05.643 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: use this backend unless the backend configuration changes.
19:27:06.629 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Initializing provider plugins...
19:27:06.629 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of integrations/github from the dependency lock file
19:27:06.630 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Initializing provider plugins...
19:27:06.630 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Reusing previous version of olivr/gpg from the dependency lock file
19:27:06.832 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of hashicorp/random from the dependency lock file
19:27:06.859 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Reusing previous version of integrations/github from the dependency lock file
19:27:06.908 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Reusing previous version of hashicorp/tls from the dependency lock file
19:27:08.258 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installing olivr/gpg v0.2.1...
19:27:08.290 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing integrations/github v6.3.0...
19:27:09.225 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installed olivr/gpg v0.2.1. Signature validation was skipped due to the registry not containing GPG keys for this provider
19:27:09.304 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed integrations/github v6.3.0 (signed, key ID 38027F80D7FD5FB2)
19:27:10.191 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installing integrations/github v6.3.0...
19:27:10.506 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing hashicorp/random v3.6.3...
19:27:11.191 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: - Installed integrations/github v6.3.0 (signed, key ID 38027F80D7FD5FB2)
19:27:11.191 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: Providers are signed by their developers.
19:27:11.191 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
19:27:11.192 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
19:27:11.192 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
19:27:11.192 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
19:27:11.192 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: version control system if they represent changes you intended to make.
19:27:11.192 STDOUT [../k3s-issuer-gpg-key] tofu1.8.3: OpenTofu has been successfully initialized!
19:27:11.459 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed hashicorp/random v3.6.3 (signed, key ID 0C0AF313E5FD9F80)
19:27:12.641 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installing hashicorp/tls v4.0.6...
19:27:13.597 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: - Installed hashicorp/tls v4.0.6 (signed, key ID 0C0AF313E5FD9F80)
19:27:13.597 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: Providers are signed by their developers.
19:27:13.597 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
19:27:13.598 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
19:27:13.598 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
19:27:13.598 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
19:27:13.598 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: version control system if they represent changes you intended to make.
19:27:13.598 STDOUT [../k3s-issuer-pages-repo] tofu1.8.3: OpenTofu has been successfully initialized!
19:27:15.790 STDOUT tofu1.8.3: Initializing the backend...
19:27:17.106 STDOUT tofu1.8.3: Successfully configured the backend "remote"! OpenTofu will automatically
19:27:17.106 STDOUT tofu1.8.3: use this backend unless the backend configuration changes.
19:27:17.991 STDOUT tofu1.8.3: Initializing provider plugins...
19:27:17.991 STDOUT tofu1.8.3: - Reusing previous version of hetznercloud/hcloud from the dependency lock file
19:27:18.172 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/tls from the dependency lock file
19:27:18.219 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/random from the dependency lock file
19:27:18.294 STDOUT tofu1.8.3: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
19:27:18.422 STDOUT tofu1.8.3: - Reusing previous version of hashicorp/aws from the dependency lock file
19:27:18.482 STDOUT tofu1.8.3: - Finding latest version of hashicorp/null...
19:27:19.994 STDOUT tofu1.8.3: - Installing hashicorp/aws v5.68.0...
19:27:27.975 STDOUT tofu1.8.3: - Installed hashicorp/aws v5.68.0 (signed, key ID 0C0AF313E5FD9F80)
19:27:28.807 STDOUT tofu1.8.3: - Installing hashicorp/null v3.2.3...
19:27:29.382 STDOUT tofu1.8.3: - Installed hashicorp/null v3.2.3 (signed, key ID 0C0AF313E5FD9F80)
19:27:30.316 STDOUT tofu1.8.3: - Installing hetznercloud/hcloud v1.48.1...
19:27:31.258 STDOUT tofu1.8.3: - Installed hetznercloud/hcloud v1.48.1 (signed, key ID 5219EACB3A77198B)
19:27:32.161 STDOUT tofu1.8.3: - Installing hashicorp/tls v4.0.6...
19:27:32.884 STDOUT tofu1.8.3: - Installed hashicorp/tls v4.0.6 (signed, key ID 0C0AF313E5FD9F80)
19:27:33.688 STDOUT tofu1.8.3: - Installing hashicorp/random v3.6.3...
19:27:34.088 STDOUT tofu1.8.3: - Installed hashicorp/random v3.6.3 (signed, key ID 0C0AF313E5FD9F80)
19:27:35.469 STDOUT tofu1.8.3: - Installing cloudflare/cloudflare v4.42.0...
19:27:36.789 STDOUT tofu1.8.3: - Installed cloudflare/cloudflare v4.42.0 (signed, key ID C76001609EE3B136)
19:27:36.789 STDOUT tofu1.8.3: Providers are signed by their developers.
19:27:36.789 STDOUT tofu1.8.3: If you'd like to know more about provider signing, you can read about it here:
19:27:36.789 STDOUT tofu1.8.3: https://opentofu.org/docs/cli/plugins/signing/
19:27:36.789 STDOUT tofu1.8.3: OpenTofu has made some changes to the provider dependency selections recorded
19:27:36.790 STDOUT tofu1.8.3: in the .terraform.lock.hcl file. Review those changes and commit them to your
19:27:36.790 STDOUT tofu1.8.3: version control system if they represent changes you intended to make.
19:27:36.790 STDOUT tofu1.8.3: OpenTofu has been successfully initialized!
19:27:43.384 STDOUT tofu1.8.3: hcloud_primary_ip.this["ipv6"]: Refreshing state... [id=68641522]
19:27:43.384 STDOUT tofu1.8.3: random_password.k3s_token: Refreshing state... [id=none]
19:27:43.384 STDOUT tofu1.8.3: hcloud_network.this: Refreshing state... [id=10090102]
19:27:43.389 STDOUT tofu1.8.3: data.cloudflare_zone.this: Reading...
19:27:43.395 STDOUT tofu1.8.3: tls_private_key.this: Refreshing state... [id=66dfe3eccaa9b069015a22812e79e4c13ae8033a]
19:27:43.395 STDOUT tofu1.8.3: hcloud_primary_ip.this["ipv4"]: Refreshing state... [id=68641521]
19:27:43.398 STDOUT tofu1.8.3: hcloud_firewall.this: Refreshing state... [id=1587707]
19:27:43.399 STDOUT tofu1.8.3: hcloud_volume.varlib: Refreshing state... [id=101246358]
19:27:43.420 STDOUT tofu1.8.3: hcloud_ssh_key.this: Refreshing state... [id=22765653]
19:27:43.554 STDOUT tofu1.8.3: hcloud_network_subnet.this: Refreshing state... [id=10090102-172.16.16.0/20]
19:27:43.572 STDOUT tofu1.8.3: hcloud_server.this: Refreshing state... [id=52684920]
19:27:43.852 STDOUT tofu1.8.3: hcloud_volume_attachment.varlib: Refreshing state... [id=101246358]
19:27:43.852 STDOUT tofu1.8.3: hcloud_firewall_attachment.this: Refreshing state... [id=1587707]
19:27:43.852 STDOUT tofu1.8.3: hcloud_server_network.this: Refreshing state... [id=52684920-10090102]
19:27:44.285 STDOUT tofu1.8.3: data.cloudflare_zone.this: Read complete after 1s [id=e0cc9a85b6f39e176952e80f9b744248]
19:27:44.292 STDOUT tofu1.8.3: cloudflare_record.newsletter["A"]: Refreshing state... [id=d95b423dfa835ab2119e2632418b3042]
19:27:44.292 STDOUT tofu1.8.3: cloudflare_record.vmagent["A"]: Refreshing state... [id=0352915c8f7b31f76a83bdeaab37356e]
19:27:44.292 STDOUT tofu1.8.3: cloudflare_record.vmagent["AAAA"]: Refreshing state... [id=68f9441c3cec3f737ef002bde5ffca29]
19:27:44.293 STDOUT tofu1.8.3: cloudflare_record.newsletter["AAAA"]: Refreshing state... [id=faa03b14676e9bed2bca92864c4ec66b]
19:27:44.297 STDOUT tofu1.8.3: cloudflare_record.auth["AAAA"]: Refreshing state... [id=709856879eca01fc17ca016cacd1389b]
19:27:44.297 STDOUT tofu1.8.3: cloudflare_record.auth["A"]: Refreshing state... [id=eeb2a3fd0f6b0e42abc21a1c3785fb21]
19:27:44.297 STDOUT tofu1.8.3: cloudflare_record.alertmanager["A"]: Refreshing state... [id=02c0c652542029a4374b2512407d10cf]
19:27:44.297 STDOUT tofu1.8.3: cloudflare_record.vmsingle["A"]: Refreshing state... [id=d1a7ec5d2b154f3e0c54b031dd2dc683]
19:27:44.299 STDOUT tofu1.8.3: cloudflare_record.alertmanager["AAAA"]: Refreshing state... [id=70ea2da720f31529b05ed98ffb835db8]
19:27:45.014 STDOUT tofu1.8.3: cloudflare_record.vmsingle["AAAA"]: Refreshing state... [id=e550a66b7b467537ab35e4aa8bfc45fa]
19:27:45.150 STDOUT tofu1.8.3: cloudflare_record.atlantis["A"]: Refreshing state... [id=af003e07497ecfb0be30129aa18ccdee]
19:27:45.220 STDOUT tofu1.8.3: cloudflare_record.auth_server["AAAA"]: Refreshing state... [id=fb1167036309a495d9ae9e5b11a61c33]
19:27:45.423 STDOUT tofu1.8.3: cloudflare_record.atlantis["AAAA"]: Refreshing state... [id=19a129e63172a0e0bcda002360d67f15]
19:27:45.649 STDOUT tofu1.8.3: cloudflare_record.auth_server["A"]: Refreshing state... [id=b18e490903f09fef85d3f8a201135cfd]
19:27:48.367 STDOUT tofu1.8.3: OpenTofu used the selected providers to generate the following execution
19:27:48.367 STDOUT tofu1.8.3: plan. Resource actions are indicated with the following symbols:
19:27:48.369 STDERR tofu1.8.3: Error: Invalid provider configuration
19:27:48.370 STDERR tofu1.8.3: Provider "registry.opentofu.org/hashicorp/aws" requires explicit
19:27:48.370 STDERR tofu1.8.3: configuration. Add a provider block to the root module and configure the
19:27:48.370 STDERR tofu1.8.3: provider's required arguments as described in the provider documentation.
19:27:48.370 STDERR tofu1.8.3: Error: No valid credential sources found
19:27:48.370 STDERR tofu1.8.3:   with provider["registry.opentofu.org/hashicorp/aws"],
19:27:48.370 STDERR tofu1.8.3:   on provider["registry.opentofu.org/hashicorp/aws"] with no configuration line 1:
19:27:48.370 STDERR tofu1.8.3:   (source code not available)
19:27:48.370 STDERR tofu1.8.3: Please see https://registry.terraform.io/providers/hashicorp/aws
19:27:48.370 STDERR tofu1.8.3: for more information about providing credentials.
19:27:48.370 STDERR tofu1.8.3: Error: failed to refresh cached credentials, failed to retrieve credentials,
19:27:48.370 STDERR tofu1.8.3: operation error STS: AssumeRoleWithWebIdentity, https response error
19:27:48.370 STDERR tofu1.8.3: StatusCode: 403, RequestID: 842c7cb6-252f-41eb-8781-e06f4f1995bc, api error
19:27:48.370 STDERR tofu1.8.3: AccessDenied: Not authorized to perform sts:AssumeRoleWithWebIdentity
19:27:48.370 STDOUT tofu1.8.3:   + create
19:27:48.370 STDOUT tofu1.8.3:   ~ update in-place
19:27:48.370 STDOUT tofu1.8.3: -/+ destroy and then create replacement
19:27:48.370 STDOUT tofu1.8.3: OpenTofu planned the following actions, but then encountered a problem:
19:27:48.370 STDOUT tofu1.8.3:   # hcloud_firewall_attachment.this will be updated in-place
19:27:48.370 STDOUT tofu1.8.3:   ~ resource "hcloud_firewall_attachment" "this" {
19:27:48.370 STDOUT tofu1.8.3:         id              = "1587707"
19:27:48.370 STDOUT tofu1.8.3:       ~ server_ids      = [
19:27:48.370 STDOUT tofu1.8.3:           - 52684920,
19:27:48.370 STDOUT tofu1.8.3:         ] -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:         # (2 unchanged attributes hidden)
19:27:48.371 STDOUT tofu1.8.3:     }
19:27:48.371 STDOUT tofu1.8.3:   # hcloud_server.this must be replaced
19:27:48.371 STDOUT tofu1.8.3: -/+ resource "hcloud_server" "this" {
19:27:48.371 STDOUT tofu1.8.3:       + backup_window              = (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       ~ datacenter                 = "nbg1-dc3" -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       ~ firewall_ids               = [
19:27:48.371 STDOUT tofu1.8.3:           - 1587707,
19:27:48.371 STDOUT tofu1.8.3:         ] -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       ~ id                         = "52684920" -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       ~ ipv4_address               = "128.140.71.149" -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       ~ ipv6_address               = "2a01:4f8:1c1b:68c6::1" -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       ~ ipv6_network               = "2a01:4f8:1c1b:68c6::/64" -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       - labels                     = {} -> null
19:27:48.371 STDOUT tofu1.8.3:         name                       = "personal"
19:27:48.371 STDOUT tofu1.8.3:       - placement_group_id         = 0 -> null
19:27:48.371 STDOUT tofu1.8.3:       ~ primary_disk_size          = 40 -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       ~ status                     = "running" -> (known after apply)
19:27:48.371 STDOUT tofu1.8.3:       ~ user_data                  = (sensitive value) # forces replacement
19:27:48.371 STDOUT tofu1.8.3:         # (10 unchanged attributes hidden)
19:27:48.371 STDOUT tofu1.8.3:         # (1 unchanged block hidden)
19:27:48.371 STDOUT tofu1.8.3:     }
19:27:48.371 STDOUT tofu1.8.3:   # hcloud_server_network.this must be replaced
19:27:48.371 STDOUT tofu1.8.3: -/+ resource "hcloud_server_network" "this" {
19:27:48.371 STDOUT tofu1.8.3:       - alias_ips   = [] -> null
19:27:48.372 STDOUT tofu1.8.3:       ~ id          = "52684920-10090102" -> (known after apply)
19:27:48.372 STDOUT tofu1.8.3:       ~ ip          = "172.16.16.1" -> (known after apply)
19:27:48.372 STDOUT tofu1.8.3:       ~ mac_address = "86:00:00:fa:b1:cf" -> (known after apply)
19:27:48.372 STDOUT tofu1.8.3:       ~ server_id   = 52684920 # forces replacement -> (known after apply) # forces replacement
19:27:48.372 STDOUT tofu1.8.3:         # (1 unchanged attribute hidden)
19:27:48.372 STDOUT tofu1.8.3:     }
19:27:48.372 STDOUT tofu1.8.3:   # hcloud_volume_attachment.varlib must be replaced
19:27:48.372 STDOUT tofu1.8.3: -/+ resource "hcloud_volume_attachment" "varlib" {
19:27:48.372 STDOUT tofu1.8.3:       ~ id        = "101246358" -> (known after apply)
19:27:48.372 STDOUT tofu1.8.3:       ~ server_id = 52684920 # forces replacement -> (known after apply) # forces replacement
19:27:48.372 STDOUT tofu1.8.3:         # (2 unchanged attributes hidden)
19:27:48.372 STDOUT tofu1.8.3:     }
19:27:48.372 STDOUT tofu1.8.3:   # null_resource.example will be created
19:27:48.372 STDOUT tofu1.8.3:   + resource "null_resource" "example" {
19:27:48.372 STDOUT tofu1.8.3:       + id = (known after apply)
19:27:48.372 STDOUT tofu1.8.3:     }
19:27:48.372 STDOUT tofu1.8.3: Plan: 4 to add, 1 to change, 3 to destroy.
19:27:48.372 STDOUT tofu1.8.3: Changes to Outputs:
19:27:48.372 STDOUT tofu1.8.3:   ~ cloudinit_config = (sensitive value)
19:27:48.592 ERROR  tofu invocation failed in .
19:27:48.592 ERROR  error occurred:

* Failed to execute "tofu1.8.3 plan -input=false -no-color -out ./default.tfplan" in .
  
  Error: Invalid provider configuration
  
  Provider "registry.opentofu.org/hashicorp/aws" requires explicit
  configuration. Add a provider block to the root module and configure the
  provider's required arguments as described in the provider documentation.
  
  
  Error: No valid credential sources found
  
    with provider["registry.opentofu.org/hashicorp/aws"],
    on provider["registry.opentofu.org/hashicorp/aws"] with no configuration line 1:
    (source code not available)
  
  Please see https://registry.terraform.io/providers/hashicorp/aws
  for more information about providing credentials.
  
  Error: failed to refresh cached credentials, failed to retrieve credentials,
  operation error STS: AssumeRoleWithWebIdentity, https response error
  StatusCode: 403, RequestID: 842c7cb6-252f-41eb-8781-e06f4f1995bc, api error
  AccessDenied: Not authorized to perform sts:AssumeRoleWithWebIdentity
  
  
  exit status 1

19:27:48.603 ERROR  Suggested fixes: 
Missing AWS credentials. Provide credentials to proceed.


```
</details>